app/controllers/admin/user_controller.rb

SELECT `users`.* FROM `users`
---
  def show
    @user = User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password_hash`, `password_salt`, `updated_at`, `user_name`) VALUES ('2013-09-10 13:12:34', 'e@e.com', 'name', 'test', '$2a$10$aR090dMknw.d/kOBoa5OxOkbVLTc41EPKJKgCgaAZIeuze8wMM5Bu', '$2a$10$aR090dMknw.d/kOBoa5OxO', '2013-09-10 13:12:34', 'testname')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password_salt` = '$2a$10$YF2PFiwEtz7siyi8UFcB5O', `password_hash` = '$2a$10$YF2PFiwEtz7siyi8UFcB5OecoHtD3xXlpCg3uxSKxRFzRTX1aB8Zm', `updated_at` = '2013-09-10 13:10:13' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

DELETE FROM `users` WHERE `users`.`id` = 7
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---
  def destroy
    @user = User.find(params[:id]).destroy