app/views/access/_user_snapshot.html.erb

SELECT `users`.* FROM `users`
---
  <ul>
    <%@calendar.get_users.each do |user|%>