app/views/admin/user/index.html.erb

SELECT `users`.* FROM `users`
---
    </div>
    <div><%= pluralize(@user.size, 'User')%> found</div>