app/views/admin/user/show.html.erb

SELECT `users`.* FROM `users`
---
  </div>
  <div><%= pluralize(@user.size, 'User')%> found</div>