app/controllers/appointments_controller.rb

  def index
    # Get the Users
    # the entire booking is based on the instructors (*users)
    user = User.all
    @view_model = UserAppointments.new(user,
                                       BusinessHours
                                        .new(APP_CONFIG['opening'],
                                             APP_CONFIG['closing']
                                        )
                                      )


=begin
    while timeupto > timetogoback do
      timetogoback += 1.hour
      print "#{timetogoback}\n"
    end
=end
=begin
    @appointments = Appointment.all
---
SELECT `users`.* FROM `users`
SELECT `appointments`.* FROM `appointments`

  def show
    @appointment = Appointment.find_all_by_date(params[:date])
---
SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`date` = '2013-09-20'