app/views/appointments/index.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---

<% @view_model.user.each do |user| %>

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`user_id` = 1 AND (date = '2013-09-18')
---
  <tr>
    <%user.appointments.each do |appointment|%>